// Порівняння чисел: За допомогою prompt отримайте два числа від користувача.
// Використовуючи if, else if, і else, виведіть у консоль, яке з них більше, менше, або вони рівні.
// Пам'ятайте про різницю між == і ===.

// let firstNumber = Number(prompt('Введіть перше число'));
// let secondNumber = Number(prompt('Введіть друге число'));

//  if(firstNumber === secondNumber){
//     console.log(`Це однакові числа`);
//  }
//  else if(firstNumber > secondNumber){
//     console.log(`Перше число більше ніж друге`);
//  }
//  else{
//     console.log(`Друге число більше ніж перше`);
//  }


// Перевірка парності: Запитайте у користувача число за допомогою prompt.
// Використовуючи оператор % та if-else, визначте, чи є число парним або непарним, 
// і виведіть відповідне повідомлення у консоль.

// let firstNumber = Number(prompt('Введіть перше число'));
// let secondNumber = Number(prompt('Введіть друге число'));

// if(firstNumber %2===0, secondNumber %2===0){
//     console.log(`Числа парні`);
// }
// else if(firstNumber %2!=0, secondNumber %2!=0){
//     console.log('Числа непарні');
// }
// Не розумію як дописати останню умову
// else{
// }


// Визначення року народження: Запитайте в користувача його вік за допомогою prompt.
// Використовуючи отримане значення та поточний рік (ви можете захардкодити поточний рік), виведіть у консоль рік народження користувача.

// let thisYear = 2024;

// if(thisYear === 2024){
//     alert('Welcome!');
// }
// else{
//     console.log('This year is not 2024');
// }

// let userAge = Number(prompt('Введіть свій вік'));
// let userBirthYear = thisYear - userAge;
// console.log(`Ви народилися ${userBirthYear}`);


// Вгадай число: Запитайте у користувача число. Якщо введене число більше заданого вами (наприклад, 10), виведіть "Занадто велике". Якщо менше - "Занадто мале".
// Якщо користувач вгадав число, виведіть "Вітаємо, ви вгадали!".

// let correctNumber = 10;
// let guessNumber = Number(prompt('Спробуйте вгадати число'));

// if(guessNumber === correctNumber){
//     console.log('Вітаю, ви вгадали число!');
// }
// else if(guessNumber > correctNumber){
//     console.log('Занадто велике число!');
// }
// else{
//     console.log('Замале число!');
// }


// Класифікація за оцінками: Запитайте у користувача його оцінку за 10-бальною шкалою за допомогою prompt.
// За допомогою if-else виведіть в консоль "Відмінно" (8-10), "Добре" (5-7), "Задовільно" (3-4), "Незадовільно" (менше 3).

// let userGrade = Number(prompt('Введіть свою оцінку'));

// if(userGrade>=8 && userGrade<=10){
//     console.log('Відмінно!');
// }
// else if(userGrade>=5 && userGrade<=7){
//     console.log('Добре');
// }
// else if(userGrade>=3 && userGrade<=4){
//     console.log('Задовільно');
// }
// else{
//     console.log('Незадовільно');
// }


// Перевірка діапазону: Запитайте у користувача число.
// Якщо число знаходиться в діапазоні від 1 до 100 включно, виведіть "Число знаходиться в діапазоні". Якщо ні - "Число поза діапазоном".

// let firstNumber = Number(prompt('Введіть число'));

// if(firstNumber>=1 && firstNumber<=100){
//     console.log(`Число ${firstNumber} знаходиться в діапазоні`);
// }
// else{
//     console.log(`Число ${firstNumber} знаходиться поза діапазоном`);
// }


// Перепишіть використовуючи тернарний оператор
//         let result = '';
//         let score = 75;
//         if (score > 50) {
//             result ="Пройшов";
//         } else {
//             result ="Не пройшов";
//         }
//         let tempResult = "";
//         let temperature = 30;
//         if (temperature > 25) {
//             tempResult ="Гаряче";
//         } else {
//             tempResult ="Прохолодно";
//         }

// let score = 75;
// let result = score > 50 ? 'Пройшов' : 'Не пройшов';
// console.log(result);

// let temperature = 30;
// let tempResult = temperature > 25 ? 'Гаряче' : 'Прохолодно';
// console.log(tempResult);


// Створіть програму для перевірки віку та країни проживання користувача з використанням prompt.
// Користувач має ввести свій вік та країну. Якщо вік більше 18 років і користувач з України, виведіть "Вітаємо, ви маєте право голосу в Україні".
// В іншому випадку, якщо вік більше 18, але країна не Україна, виведіть "Перевірте правила голосування у вашій країні".
// Якщо вік менше 18, виведіть "Ви ще занадто молоді для голосування".

let userAge = Number(prompt('Введіть свій вік'));
let userCountry = Number(prompt('Введіть свою країну проживання'));

if(userAge <= 18 && userCountry == 'Україна'){
    console.log('Вітаємо, ви маєте право голосу в Україні');
}
else if(userAge > 18){
    console.log('Перевірте правила голосування у вашій країні');
}
else{
    console.log('Ви ще занадто молоді для голосування');
}